[Killed] BooleanLiteral
exercicios-fork/exercise-digimon-finders/src/App.js:49:25
         >
           Search Digimon
         </button>
-        { isFetching && !errorMessage
+        { isFetching && errorMessage
           ? <Digimon digimon={digimon} />
           : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
